04_OpenFoam/_Tut_02/OpenFOAMTeaching/JozsefNagy/livestreams/03_Third-tutorial/S3/shockTube/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication setFields

runApplication $(getApplication)

runApplication -s sample postProcess -func sample -noZero

#------------------------------------------------------------------------------
